[
  {
    "title": "Senior Software Engineer",
    "organization": "Alteryx",
    "description": [
      "Collaborated with stakeholders to shape the design and implementation of several client-facing software systems",
      "Built numerous applications, 2 of which generated $1.8M and $1.4M in annual recurring revenue (ARR)",
      "Spearheaded various initiatives, including the creation of a shared component library, the implementation of linting and formatting guidelines, unit and end-to-end testing, CI/CD, feature flags, etc.",
      "Guided and onboarded new hires while serving as a subject matter expert (SME) in critical areas"
    ]
  },
  {
    "title": "Cloud Services Developer (SWE II)",
    "organization": "HP",
    "description": [
      "Solely maintained an internal software service; optimized the Django backend to reduce average API latency by 20% while simultaneously introducing a React frontend",
      "Improved system scalability and resilience through containerization, distributed multitasking, etc.",
      "Implemented cloud-based services that seamlessly integrated with platforms and organizations across HP"
    ]
  },
  {
    "title": "Software Engineering Intern",
    "organization": "Air-Weigh",
    "description": [
      "Designed and developed a full-stack cloud application using Django, React, MySQL, and AWS",
      "Maintained a SaaS solution built with Java Spring Boot, JavaScript, MySQL, Apache Tomcat, and AWS",
      "Developed a microservices prototype with Flask, PostgreSQL, React, and Redux"
    ]
  },
  {
    "title": "Software Engineering Intern",
    "organization": "TDS Telecom",
    "description": [
      "Developed ETL pipelines using Python and SQL for network diagnostics and capacity reporting",
      "Optimized automated processes, resulting in reduced server load and enhanced performance",
      "Followed Test-Driven Development (TDD) to integrate coding, testing, and design into a unified process"
    ]
  },
  {
    "title": "Education",
    "organization": "University of Oregon",
    "description": [
      "B.S. in Computer Science (Departmental Honors) - Software Development Track",
      "B.S. in Spatial Data Science (Departmental Honors)",
      "Minor in Music Technology",
      "Phi Beta Kappa Honor Society"
    ]
  }
]
