{
    "items": [
        {
            "label": "Professional Software Engineer",
            "subtitle": "Alteryx",
            "description": [
                "Developed several frontend applications using React & TypeScript",
                "Enabled Continuous Integration and Continuous Delivery (CICD) by creating Gitlab CI scripts and templates",
                "Met with key stakeholders to inform the design of client-facing software systems"
            ]
        },
        {
            "label": "Cloud Developer (Software Engineer II)",
            "subtitle": "HP",
            "description": [
                "Maintained full product ownership of an internal software service; optimized the Django backend to reduce average API latency by 20% while simultaneously introducing a React frontend",
                "Architected and implemented cloud-based services interfacing with multiple platforms and organizations across Hewlett-Packard",
                "Improved system scalability by implementing containerization, asynchronous messaging, distributed multitasking, etc."
            ]
        },
        {
            "label": "Software Engineering Intern",
            "subtitle": "Air-Weigh",
            "description": [
                "Designed and developed a full-stack cloud application using Django, React, MySQL, and AWS",
                "Maintained a SaaS solution built with Java Spring Boot, JavaScript, MySQL, Apache Tomcat, and AWS",
                "Developed a microservices prototype with Flask, PostgreSQL, React, and Redux"
            ]
        },
        {
            "label": "Software Engineering Intern",
            "subtitle": "TDS Telecom",
            "description": [
                "Developed ETL pipelines using Python and SQL for network diagnostics and capacity reporting",
                "Optimized automated processes to reduce server load",
                "Followed Test-Driven Development to integrate coding, testing, and design into a unified process"
            ]
        },
        {
            "label": "Education",
            "subtitle": "University of Oregon",
            "description": [
                "B.S. in Computer Science (Departmental Honors) - Software Development Track",
                "B.S. in Spatial Data Science (Departmental Honors)",
                "Minor in Music Technology"
            ]
        }
    ]
}