{
    "items": [
        {
            "label": "Cloud Developer (Software Engineer II)",
            "subtitle": "HP",
            "description": [
                "Maintained full product ownership of an internal software service; optimizing the Django backend to reduce average API latency by 20% while simultaneously introducing a React frontend",
                "Designed, developed, and delivered cloud-based services interfacing with multiple platforms and organizations across Hewlett Packard",
                "Architected and implemented containerized full-stack software solutions to enable automated data processing",
                "Improved system scalability by implementing container orchestration, asynchronous message queuing, distributed multitasking, etc."
            ]
        },
        {
            "label": "Software Engineering Intern",
            "subtitle": "Air-Weigh",
            "description": [
                "Designed and developed a full-stack cloud application using Django, React, MySQL, and AWS",
                "Developed a microservice prototype consisting of a Flask API, a PostgreSQL database, and a front-end built with React & Redux",
                "Maintained a SaaS solution built with Java Spring, JavaScript, MySQL, Apache Tomcat, and AWS"
            ]
        },
        {
            "label": "Software Engineering Intern",
            "subtitle": "TDS",
            "description": [
                "Developed ETL pipelines using Python and SQL for network diagnostics and capacity reporting",
                "Optimized automated processes to reduce server load",
                "Followed Test-Driven Development to integrate coding, testing, and design into a unified process"
            ]
        },
        {
            "label": "Education",
            "subtitle": "University of Oregon",
            "description": [
                "B.S. in Computer Science (Departmental Honors) - Software Development Track",
                "B.S. in Spatial Data Science (Departmental Honors)",
                "Minor in Music Technology"
            ]
        }
    ]
}